conformance/mega-backend/generated/determine-journey-warnings-execution.puml
@startuml
title determine journey warnings
left to right direction
usecase "Start" as n1
rectangle "warnings" as n2
diamond "select applicable decision rule" as n3
rectangle "invalid journey rule" as n4
rectangle "evaluate is journey" as n5
diamond "task equals reisen" as n6
rectangle "derive grouped project time entries" as n7
rectangle "warnings" as n8
rectangle "journey direction" as n9
diamond "a following entry exists" as n10
rectangle "evaluate try to get next journey direction" as n11
diamond "a following entry exists" as n12
rectangle "use journey time entries following entry journey direction" as n13
rectangle "use absent" as n14
rectangle "derive next direction as try to get next journey direction grouped project time entries" as n15
rectangle "evaluate journey direction" as n16
diamond "choose by current direction" as n17
diamond "former direction equals to" as n18
diamond "former direction equals further" as n19
rectangle "set warning to back missing" as n20
rectangle "set former direction to current direction" as n21
diamond "former direction is absent" as n22
diamond "former direction equals back" as n23
rectangle "set warning to to missing" as n24
diamond "former direction exists" as n25
rectangle "set former direction to current direction" as n26
rectangle "decision cannot continue" as n27
rectangle "evaluate is finished" as n28
diamond "former direction exists" as n29
diamond "former direction equals back" as n30
rectangle "evaluate is starting new journey" as n31
diamond "warning is absent" as n32
diamond "is not finished" as n33
diamond "next direction is absent" as n34
diamond "is starting new journey next direction" as n35
rectangle "set former direction to absent" as n36
rectangle "derive warning" as n37
diamond "warning exists" as n38
rectangle "create journey warning" as n39
rectangle "journey warning" as n40
rectangle "set journey warning date" as n41
rectangle "evaluate add" as n42
rectangle "evaluate add" as n43
rectangle "invalid working location in journey rule" as n44
rectangle "derive sorted project entries" as n45
rectangle "warnings" as n46
rectangle "evaluate has journey entries" as n47
rectangle "evaluate is task" as n48
rectangle "evaluate is journey" as n49
diamond "task equals reisen" as n50
diamond "is not journey task" as n51
diamond "does not have journey entries sorted project entries" as n52
diamond "for each project entry in sorted project entries" as n53
rectangle "evaluate is journey" as n54
diamond "task equals reisen" as n55
diamond "task is journey project entry task" as n56
rectangle "derive journey direction" as n57
diamond "journey direction equals back" as n58
rectangle "set working location to main" as n59
diamond "journey direction equals to" as n60
diamond "journey direction equals further" as n61
rectangle "set working location to project entry working location" as n62
diamond "project entry working location does not equal working location" as n63
rectangle "create journey warning" as n64
rectangle "journey warning" as n65
rectangle "set journey warning date" as n66
rectangle "evaluate add" as n67
rectangle "evaluate add" as n68
rectangle "location relevant set journey rule" as n69
rectangle "warnings" as n70
diamond "for each project entry in project entries" as n71
diamond "project entry work location is project relevant" as n72
diamond "none of warnings match item date equals project entry date" as n73
rectangle "create journey warning" as n74
rectangle "journey warning" as n75
rectangle "set journey warning date" as n76
rectangle "evaluate add" as n77
rectangle "evaluate add" as n78
rectangle "derive calculated warnings" as n79
rectangle "evaluate add to journey warnings" as n80
rectangle "evaluate text for warning type" as n81
rectangle "evaluate message template" as n82
diamond "select applicable decision rule" as n83
rectangle "journey warning type rule" as n84
rectangle "time warning type rule" as n85
diamond "select applicable decision rule" as n86
rectangle "journey warning type rule" as n87
rectangle "time warning type rule" as n88
rectangle "evaluate add" as n89
rectangle "derive journey warning" as n90
diamond "journey warning is present" as n91
rectangle "evaluate add all" as n92
rectangle "evaluate add all" as n93
rectangle "evaluate add" as n94
rectangle "evaluate sort" as n95
usecase "Stop" as n96
n1 -[#9E9E9E,dashed]-> n2 : next
n2 -[#9E9E9E,dashed]-> n3 : next
n3 -[#2E7D32,thickness=3]-> n4 : selected rule
n4 -[#9E9E9E,dashed]-> n5 : next
n5 -[#9E9E9E,dashed]-> n6 : next
n6 -[#9E9E9E,dashed]-> n7 : true
n6 -[#9E9E9E,dashed]-> n7 : false
n7 -[#9E9E9E,dashed]-> n8 : next
n8 -[#9E9E9E,dashed]-> n9 : next
n9 -[#9E9E9E,dashed]-> n10 : next
n10 -[#9E9E9E,dashed]-> n11 : yes
n11 -[#9E9E9E,dashed]-> n12 : next
n12 -[#9E9E9E,dashed]-> n13 : true
n12 -[#9E9E9E,dashed]-> n14 : false
n13 -[#9E9E9E,dashed]-> n15 : result
n14 -[#9E9E9E,dashed]-> n15 : result
n15 -[#9E9E9E,dashed]-> n16 : next
n16 -[#9E9E9E,dashed]-> n17 : next
n18 -[#9E9E9E,dashed]-> n19 : false
n17 -[#9E9E9E,dashed]-> n18 : to
n18 -[#9E9E9E,dashed]-> n20 : true
n19 -[#9E9E9E,dashed]-> n20 : true
n20 -[#9E9E9E,dashed]-> n21 : next
n19 -[#9E9E9E,dashed]-> n21 : false
n22 -[#9E9E9E,dashed]-> n23 : false
n17 -[#9E9E9E,dashed]-> n22 : further or back
n22 -[#9E9E9E,dashed]-> n24 : true
n23 -[#9E9E9E,dashed]-> n24 : true
n24 -[#9E9E9E,dashed]-> n25 : next
n23 -[#9E9E9E,dashed]-> n25 : false
n25 -[#9E9E9E,dashed]-> n26 : true
n17 -[#9E9E9E,dashed]-> n27 : default
n21 -[#9E9E9E,dashed]-> n28 : next
n26 -[#9E9E9E,dashed]-> n28 : next
n25 -[#9E9E9E,dashed]-> n28 : false
n29 -[#9E9E9E,dashed]-> n30 : true
n28 -[#9E9E9E,dashed]-> n29 : next
n30 -[#9E9E9E,dashed]-> n31 : true
n29 -[#9E9E9E,dashed]-> n31 : false
n30 -[#9E9E9E,dashed]-> n31 : false
n32 -[#9E9E9E,dashed]-> n33 : true
n34 -[#9E9E9E,dashed]-> n35 : false
n33 -[#9E9E9E,dashed]-> n34 : true
n31 -[#9E9E9E,dashed]-> n32 : result
n34 -[#9E9E9E,dashed]-> n36 : true
n35 -[#9E9E9E,dashed]-> n36 : true
n36 -[#9E9E9E,dashed]-> n37 : result
n32 -[#9E9E9E,dashed]-> n37 : false
n33 -[#9E9E9E,dashed]-> n37 : false
n35 -[#9E9E9E,dashed]-> n37 : false
n37 -[#9E9E9E,dashed]-> n38 : next
n38 -[#9E9E9E,dashed]-> n39 : true
n39 -[#9E9E9E,dashed]-> n40 : next
n40 -[#9E9E9E,dashed]-> n41 : next
n41 -[#9E9E9E,dashed]-> n42 : next
n42 -[#9E9E9E,dashed]-> n43 : result
n43 -[#9E9E9E,dashed]-> n10 : next entry
n38 -[#9E9E9E,dashed]-> n10 : next entry
n3 -[#2E7D32,thickness=3]-> n44 : selected rule
n44 -[#2E7D32,thickness=3]-> n45 : next
n45 -[#2E7D32,thickness=3]-> n46 : next
n46 -[#2E7D32,thickness=3]-> n47 : next
n47 -[#2E7D32,thickness=3]-> n48 : next
n48 -[#2E7D32,thickness=3]-> n49 : next
n49 -[#2E7D32,thickness=3]-> n50 : next
n50 -[#2E7D32,thickness=3]-> n51 : true
n50 -[#9E9E9E,dashed]-> n51 : false
n51 -[#2E7D32,thickness=3]-> n52 : true
n51 -[#9E9E9E,dashed]-> n52 : false
n52 -[#9E9E9E,dashed]-> n53 : false
n53 -[#9E9E9E,dashed]-> n54 : item
n54 -[#9E9E9E,dashed]-> n55 : next
n55 -[#9E9E9E,dashed]-> n56 : true
n55 -[#9E9E9E,dashed]-> n56 : false
n56 -[#9E9E9E,dashed]-> n57 : true
n57 -[#9E9E9E,dashed]-> n58 : next
n58 -[#9E9E9E,dashed]-> n59 : true
n60 -[#9E9E9E,dashed]-> n61 : false
n59 -[#9E9E9E,dashed]-> n60 : next
n58 -[#9E9E9E,dashed]-> n60 : false
n60 -[#9E9E9E,dashed]-> n62 : true
n61 -[#9E9E9E,dashed]-> n62 : true
n62 -[#9E9E9E,dashed]-> n63 : next
n61 -[#9E9E9E,dashed]-> n63 : false
n56 -[#9E9E9E,dashed]-> n63 : false
n63 -[#9E9E9E,dashed]-> n64 : true
n64 -[#9E9E9E,dashed]-> n65 : next
n65 -[#9E9E9E,dashed]-> n66 : next
n66 -[#9E9E9E,dashed]-> n67 : next
n67 -[#9E9E9E,dashed]-> n68 : result
n68 -[#9E9E9E,dashed]-> n53 : next item
n63 -[#9E9E9E,dashed]-> n53 : next item
n3 -[#2E7D32,thickness=3]-> n69 : selected rule
n69 -[#2E7D32,thickness=3]-> n70 : next
n70 -[#2E7D32,thickness=3]-> n71 : next
n72 -[#9E9E9E,dashed]-> n73 : true
n71 -[#9E9E9E,dashed]-> n72 : item
n73 -[#9E9E9E,dashed]-> n74 : true
n74 -[#9E9E9E,dashed]-> n75 : next
n75 -[#9E9E9E,dashed]-> n76 : next
n76 -[#9E9E9E,dashed]-> n77 : next
n77 -[#9E9E9E,dashed]-> n78 : result
n78 -[#9E9E9E,dashed]-> n71 : next item
n72 -[#9E9E9E,dashed]-> n71 : next item
n73 -[#9E9E9E,dashed]-> n71 : next item
n10 -[#9E9E9E,dashed]-> n79 : no
n52 -[#2E7D32,thickness=3]-> n79 : true
n53 -[#9E9E9E,dashed]-> n79 : done
n71 -[#2E7D32,thickness=3]-> n79 : done
n79 -[#2E7D32,thickness=3]-> n80 : next
n80 -[#2E7D32,thickness=3]-> n81 : next
n81 -[#2E7D32,thickness=3]-> n82 : next
n82 -[#2E7D32,thickness=3]-> n83 : next
n83 -[#2E7D32,thickness=3]-> n84 : selected rule
n83 -[#9E9E9E,dashed]-> n85 : selected rule
n84 -[#2E7D32,thickness=3]-> n86 : result
n85 -[#9E9E9E,dashed]-> n86 : result
n86 -[#2E7D32,thickness=3]-> n87 : selected rule
n86 -[#9E9E9E,dashed]-> n88 : selected rule
n87 -[#2E7D32,thickness=3]-> n89 : result
n88 -[#9E9E9E,dashed]-> n89 : result
n89 -[#2E7D32,thickness=3]-> n90 : next
n90 -[#2E7D32,thickness=3]-> n91 : next
n91 -[#9E9E9E,dashed]-> n92 : true
n92 -[#9E9E9E,dashed]-> n93 : next
n91 -[#2E7D32,thickness=3]-> n94 : false
n93 -[#9E9E9E,dashed]-> n95 : next
n94 -[#2E7D32,thickness=3]-> n95 : next
n27 -[#9E9E9E,dashed]-> n96 : fails
n95 -[#2E7D32,thickness=3]-> n96 : returns warnings
@enduml
